In [1]:
import pandas as pd

In [3]:
data=pd.read_csv("nba.csv",index_col="Name")

In [4]:
f=data.loc["Avery Bradley"]

In [5]:
f

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object

In [6]:
s = data.loc["R.J. Hunter"]

In [7]:
s

Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

In [9]:
print(f, "\n\n", s)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object

 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

In [10]:
rows=data.loc[['John Holland','Jae Crowder']]

In [11]:
rows

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0

In [21]:
row2=data.iloc[3,5]

In [22]:
row2

185.0

In [24]:
data.isnull().sum()

Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [25]:
data.shape

(458, 8)

In [28]:
d2=data.dropna()

In [29]:
d2.shape

(364, 8)

In [30]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}

In [31]:
d3=pd.DataFrame(dict)

In [36]:
for i, j in d3.iterrows():
    print(i , j)
    print()

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

In [37]:
d3

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [38]:
col=list(d3)

In [39]:
for i in col:
    print(d3[i][2])

sudhir
M.Tech
80

In [40]:
data.count()

Team        457
Number      457
Position    457
Age         457
Height      457
Weight      457
College     373
Salary      446
dtype: int64

In [41]:
data.Team.count()

457

In [42]:
data.Salary.sum()

2159837111.0

In [43]:
data.sum()

Number    8.079000e+03
Age       1.231100e+04
Weight    1.012360e+05
Salary    2.159837e+09
dtype: float64

In [44]:
data.Salary.max()

25000000.0

In [45]:
data.Salary.min()

30888.0

In [46]:
data.Salary.median()

2839073.0

In [47]:
data.Salary.mean()

4842684.105381166

In [50]:
data.groupby('College').mean()[['Salary']]

                             Salary
College
Alabama                1.421686e+06
Arizona                3.325948e+06
Arizona State          7.933941e+06
Arkansas               2.713180e+06
Baylor                 9.813480e+05
Belmont                9.472760e+05
Blinn College          5.000000e+06
Boston College         9.144022e+06
Boston University               NaN
Bowling Green          1.074169e+06
Bucknell               9.472760e+05
Butler                 8.921452e+06
California             3.212244e+06
Central Michigan       5.016000e+06
Charleston             2.006000e+05
Cincinnati             4.567108e+06
Clemson                3.982397e+06
Cleveland State        3.036927e+06
Colorado               3.839781e+06
Colorado State         4.300000e+06
Connecticut            4.914350e+06
Creighton              3.708973e+06
Davidson               1.137079e+07
Dayton                 1.918144e+06
DePaul                 1.044944e+07
Detroit                         NaN
Duke                   4.443288e+06
Eastern Washington     7.000000e+06
Florida                6.533571e+06
Florida State          1.164858e+06
...                             ...
Stanford               7.004860e+06
Syracuse               4.520970e+06
Temple                 4.050000e+06
Tennessee              5.409072e+06
Tennessee State        1.000000e+06
Texas                  8.968001e+06
Texas A&M              1.177876e+07
UC Santa Barbara       6.955950e+04
UCLA                   5.804272e+06
UNLV                   1.598402e+06
USC                    7.327741e+06
Utah                   5.186703e+06
Utah Valley            9.472760e+05
Vanderbilt             1.495048e+06
Villanova              4.646250e+06
Virginia               2.391166e+06
Virginia Commonwealth  9.472760e+05
Virginia Tech          5.617160e+05
Wake Forest            7.701478e+06
Washington             3.176172e+06
Washington State       1.100050e+07
Weber State            4.236287e+06
Westchester CC         5.250930e+05
Western Carolina       2.006000e+05
Western Kentucky       3.387801e+06
Western Michigan       8.450590e+05
Wichita State          8.450590e+05
Wisconsin              1.974492e+06
Wyoming                1.155600e+06
Xavier                 1.499187e+06

[118 rows x 1 columns]

In [51]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

In [52]:
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

In [53]:
df3 = pd.DataFrame(data1)

In [54]:
df4=pd.DataFrame(data2)

In [55]:
frames=[df3,df4]

In [56]:
res=pd.concat(frames)

In [57]:
res

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
0    Abhi   17     Nagpur         Btech
1  Ayushi   14     Kanpur           B.A
2  Dhiraj   12  Allahabad          Bcom
3  Hitesh   52    Kannuaj        B.hons

In [58]:
res.shape

(8, 4)

In [60]:
res.index=range(8)

In [62]:
res

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [69]:
res2 = pd.concat([df3, df4], ignore_index=True)

res2

In [70]:
res2

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [75]:
res3=pd.concat([df3,df4], axis=1, sort=False)

In [76]:
res3

     Name  Age    Address Qualification    Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc    Abhi   17     Nagpur         Btech
1  Princi   24     Kanpur            MA  Ayushi   14     Kanpur           B.A
2  Gaurav   22  Allahabad           MCA  Dhiraj   12  Allahabad          Bcom
3    Anuj   32    Kannuaj           Phd  Hitesh   52    Kannuaj        B.hons